insert into USER_CATEGORY values(USER_CATEGORY_SEQ.nextVal, 'A', '관리자')
insert into USER_CATEGORY values(USER_CATEGORY_SEQ.nextVal, 'B', '사업자')
insert into USER_CATEGORY values(USER_CATEGORY_SEQ.nextVal, 'U', '유저')

select * from USER_CATEGORY

insert into users values(USERS_SEQ.nextVal, 'yolowa', 'yolowa', '욜로와', '01012345678', 'yolowa@gmail.com', '2017-07-14', 'B', sysdate)
insert into users values(USERS_SEQ.nextVal, 'businessman', '1234', '사업자1', '01012345678', 'yolowa@gmail.com', '2017-07-17', 'B', sysdate)


select * from users 

insert into HOUSE values(HOUSE_SEQ.nextVal, 1, '양평 풍경속선물 펜션', '경기 양평군 양평읍 덕바위길 93', '02-307-5173', 6, 'Y', 'Y', 'Y', 'N', 'N', 'Y', '','2017-07-04','2017-08-16', '', 'N', '14시 이후', '12시 이전',
'안녕하세요 양평 최고의 절경을 자랑하는 풍경속선물 펜션을 여러분에게 소개합니다.<br/><br/>풍경속선물 펜션은 뒤로는 유명산과 용문산이 감싸고 있으며 전면으로는 양평의 최고 절경이라고 할 수 있는 오빈리 남산 정상부에 위치하여 남한강과 양평시내를 한 눈에 볼 수 있는 펜션이라고 말씀 드릴 수 있습니다. 
<br/><br/>
말로 말씀 드리기 보다는 직접 눈으로 확인해야만 그 절경을 느낄 수 있으며 오직 선택된 커플들과 가족들에게만 허락된 이곳 풍경속선물펜션에서 호텔에서는 느낄 수 있는 실내  건강에 좋고 특색있는 황토내장의 고급스러움을 맛보며 거기에 백만불을 주어도 아깝지 않은 멋진 그림을 눈에 마음에 담아가시기를 바랍니다. 
<br/><br/>
여름엔 수영Pool이 있어 보다 즐거운 시간을 보낼 수 있습니다.<br/>
▶ 펜 션 한 줄 소 개 <br/>
차량으로 7~10분거리에 사나사 계곡이 있어 물놀이가 가능합니다. <br/>
<br/>
▶ 입실시각 : 14시 이후<br/> 
▶ 퇴실시각 : 12시 이전<br/> 
<br/>
▶ 추 가 요 금 <br/>
3세 이상부터 추가 인원에 포함되어 1만원의 추가 요금이 적용됩니다.<br/>
<br/>
▶ 픽 업 안 내 :<br/> 
최대 4명까지 픽업 가능합니다. (자세한 내용은 예약 후 펜션 문의바랍니다.)<br/>
<br/>
[ 계 곡 ] <br/>
사나사계곡이 차량으로7~10분거리에 위치 더욱시원하고 환상적인 여름 휴가을 즐기실 수 있어요. <br/>
 <br/>
[ 수 영 장 ]<br/>
수영장 크기 : 가로 4m 세로 6.4m 높이 1.6m입니다.<br/>
수영복장 : 수영복 ,수영모 필히 지참요망. 만일 미착용시 입수금지합니다.<br/>  
운영기간 : 7월 1일 ~ 8월 31일 (날씨에 따른 변동 가능)<br/>
수영장을 사용하시려면 꼭 하루전 미리 연락주세요.<br/>
<br/>
[ 바 베 큐 ]<br/> 
전망 좋은 넓은 독립테라스에서 개별적으로 바베큐가 가능합니다. 파라솔이 있어 비가와도 가능합니다.<br/>
※ 조개류 반입금지<br/>
<br/>
[ 숯, 그 릴 비 용 ]<br/> 
4인기준 1만원<br/>
<br/>
[ 주 변 관 광 지 ]<br/>
들꽃 수목원 차량5분거리. 야생화를 관람 할 수 있습니다.<br/>
양평순교선열의 기념지 양근 성지 5분거리입니다. ',sysdate)

insert into HOUSE values(HOUSE_SEQ.nextVal, 1, '가평 용추사랑 펜션', '경기 가평군 가평읍 용추로 508-51', '02-307-5173', 7, 'Y', 'N', 'Y', 'N', 'N', 'N', 'http://www.yongchulove.com/','2017-07-22','2017-08-14', '', 'N', '15시 이후', '11시 이전',
'안녕하세요. 용추사랑펜션입니다.<br/>
저희 용추사랑펜션은 가평 제일의 계곡인 용추계곡에 위치한 전망좋은 펜션으로<br/>
가족 및 연인 그리고 친구들과의 작은 모임 등을 치를 수 있는 자연속에 펜션입니다.<br/>
편션 앞에는 커다란 야외 바베큐장과 테라스가 있는 곳으로<br/>
용추 계곡이 한눈에 내려다 보이는 전망이 아주 좋은 곳입니다.<br/>
<br/>
봄에는 새파란 녹색의 자연 휴양림을 마음껏 감상할 수 있으며,<br/>
여름에는 용추계곡에서 시원한 물놀이를 즐기실 수 있습니다.<br/>
가을에는 형형색색의 단풍을<br/>
겨울에는 흰눈에 뒤덮힌 용추계곡의 설경을 마음껏 감상하실 수 있는 곳입니다.<br/>
<br/>
예약전 꼭!! 확인해주세요!!<br/>
추가요금은 현장에서 결제해주시기 바랍니다.<br/>
(1인 10,000원/단, 사랑1호 1인 20,000원)<br/>
<br/>
<br/>
▶ 펜 션 한 줄 소 개 <br/>
안녕하세요. 용추계곡이 한눈에 내려다 보이는 전망이 아주 좋은<br/>
가평 용추사랑 펜션에 오신 것을 환영합니다.<br/>
<br/>
<br/>
▶ 입실 시각 : 15시 이후 <br/>
▶ 퇴실 시각 : 11시 이전<br/>
<br/>
<br/>
▶ 추 가 요 금<br/> 
영, 유아도 추가 인원에 포함되며 0세 이상 1만원의 추가 요금이 적용됩니다.<br/> 
단, 사랑1호 객실만 추가 인원 1인당 2만원의(영, 유아 포함) 추가 요금이 적용됩니다.<br/>
(현장결제)<br/>
<br/>
<br/>
[ 바 베 큐 ] <br/>
야외 공동 바베큐장<br/>
이용시간 : ~24시까지<br/>
<br/>
<br/>
[ 숯, 그 릴 비 용 ] <br/>
구성 : 숯 + 그릴 + 집게 + 가위<br/>
가격 : 2인 1만 5천원 (추가 1인당 5,000원)<br/>
<br/>
<br/>
[ 인 터 넷 ] <br/>
펜션 내 무선인터넷사용이 가능합니다.<br/>
<br/>
<br/>
[ 계 곡 ] <br/>
펜션 앞에 용추계곡이 있습니다. <br/>
도보 5분 거리에 계곡이 있습니다.<br/>
<br/>
<br/>
[ 등 산 로 및 산 책 로 ] <br/>
펜션 뒤편 용추계곡 산책로가 있습니다.  <br/>
 <br/>
 <br/>
[ 기 타 사 항 ]<br/>
자체 픽업 불가능, 마트 픽업을 이용해주세요.<br/>',sysdate)

select * from HOUSE
delete house where no=22
insert into room values(ROOM_SEQ.nextval, 1, '무사이 ', '원룸(침대룸+주방+화장실)', '33평', 6, 8, 250000, 260000, 180000, 200000, 10000,
'구비시설<br/>
Tv, 침대, 식탁, 에어컨, 냉장고, 취사, 드라이기, 벽난로<br/>
객실설명<br/>
B동 1층 전체를 이용하며 온돌형식으로 된 원룸 객실입니다. (침대1개 있음)<br/>
<br/>
객실과 연결되는 테라스에서 독립적으로 바베큐가 가능합니다.<br/>
테라스가 있으며 테라스에서 바베큐 가능합니다.', sysdate)

insert into room values(ROOM_SEQ.nextval, 1, '무사이 ', '원룸(침대룸+주방+화장실)', '33평', 6, 8, 250000, 260000, 180000, 200000, 10000,
'구비시설<br/>
Tv, 침대, 식탁, 에어컨, 냉장고, 취사, 드라이기, 벽난로<br/>
객실설명<br/>
B동 1층 전체를 이용하며 온돌형식으로 된 원룸 객실입니다. (침대1개 있음)<br/>
<br/>
객실과 연결되는 테라스에서 독립적으로 바베큐가 가능합니다.<br/>
테라스가 있으며 테라스에서 바베큐 가능합니다.', sysdate)

insert into room values(ROOM_SEQ.nextval, 1, '플로라 ', '원룸(침대룸+주방+화장실)', '18평', 2, 2, 150000, 160000, 120000, 130000, 0,
'구비시설<br/>
Tv, 침대, 식탁, 에어컨, 냉장고, 취사, 드라이기<br/>
객실설명<br/>
B동 2층 오른쪽에 위치한 침대가 있는 원룸형 객실입니다.<br/>
<br/>
객실과 연결되는 넓은 테라스에서 독립적으로 바베큐가 가능합니다.<br/>
테라스가 있으며 테라스에서 바베큐 가능합니다.', sysdate)

insert into room values(ROOM_SEQ.nextval, 1, '포루투나', '원룸(침대룸+주방+화장실)', '18평', 2, 4, 150000, 160000, 120000, 130000, 10000,
'구비시설<br/>
Tv, 침대, 식탁, 에어컨, 냉장고, 취사, 드라이기<br/>
객실설명<br/>
A동 1층 오른쪽에 위치한 침대가 있는 원룸형 객실입니다.<br/>
<br/>
객실과 연결되는 테라스에서 독립적으로 바베큐가 가능합니다.<br/>
테라스가 있으며 테라스에서 바베큐 가능합니다.', sysdate)

insert into room values(ROOM_SEQ.nextval, 1, '빅토리아', '원룸(침대룸+주방+화장실)', '18평', 2, 4, 150000, 160000, 120000, 130000, 10000,
'구비시설<br/>
Tv, 침대, 식탁, 에어컨, 냉장고, 취사, 드라이기<br/>
객실설명<br/>
A동 1층 왼쪽에 위치한 침대가 있는 원룸형 객실입니다.<br/>
<br/>
객실과 연결되는 테라스에서 독립적으로 바베큐가 가능합니다.<br/>
테라스가 있으며 테라스에서 바베큐 가능합니다.', sysdate)

insert into room values(ROOM_SEQ.nextval, 1, '인비디아', '원룸(침대룸+주방+화장실)', '18평', 2, 2, 150000, 160000, 120000, 130000, 0,
'구비시설<br/>
Tv, 침대, 식탁, 에어컨, 냉장고, 취사, 드라이기<br/>
객실설명<br/>
A동 2층 왼쪽에 위치한 침대가 있는 원룸형 객실입니다.<br/>
<br/>
객실과 연결되는 테라스에서 독립적으로 바베큐가 가능합니다.<br/>
테라스가 있으며 테라스에서 바베큐 가능합니다.', sysdate)

insert into room values(ROOM_SEQ.nextval, 1, '판탄소스', '원룸(침대룸+주방+화장실)', '18평', 2, 2, 150000, 160000, 120000, 130000, 0,
'구비시설<br/>
Tv, 침대, 식탁, 에어컨, 냉장고, 취사, 드라이기<br/>
객실설명<br/>
A동 2층 오른쪽에 위치한 침대가 있는 원룸형객실입니다.<br/>
<br/>
객실과 연결되는 넓은 테라스에서 독립적으로 바베큐가 가능합니다.<br/>
테라스가 있으며 테라스에서 바베큐 가능합니다.', sysdate)

=======================================================================================================================================

insert into room values(ROOM_SEQ.nextval, 2, '사랑1호(독채)', '침대룸+거실+주방+화장실', '14평', 2, 6, 200000, 200000, 90000, 130000, 0,
'구비시설<br/>
에어컨, TV, 냉장고, 와이파이,싱크대, 전기밥솥, 취사도구,욕실용품<br/>
객실설명<br/>
추가 요금 현장 결제 (1인 2만원)<br/>
 <br/>
테라스는 있으나 테라스에서 바베큐가 불가능합니다.<br/>', sysdate)

insert into room values(ROOM_SEQ.nextval, 2, '용추1호', '원룸(온돌룸+주방+화장실)', '10평', 4, 6, 210000, 210000, 80000, 120000, 0,
'구비시설<br/>
에어컨, TV, 냉장고, 와이파이,싱크대, 전기밥솥, 취사도구,욕실용품<br/>
객실설명<br/>
추가 요금 현장 결제 (1인 1만원)<br/>
 <br/>
테라스는 있으나 테라스에서 바베큐가 불가능합니다.<br/>', sysdate)

insert into room values(ROOM_SEQ.nextval, 2, '계곡2호', '원룸(온돌룸+주방+화장실)', '10평', 4, 6, 210000, 210000, 80000, 120000, 0,
'구비시설<br/>
에어컨, TV, 냉장고, 와이파이,싱크대, 전기밥솥, 취사도구,욕실용품<br/>
객실설명<br/>
추가 요금 현장 결제 (1인 1만원)<br/>
 <br/>
테라스는 있으나 테라스에서 바베큐가 불가능합니다.<br/>', sysdate)

insert into room values(ROOM_SEQ.nextval, 2, '바람3호', '원룸(온돌룸+주방+화장실)', '10평', 4, 6, 210000, 210000, 80000, 120000, 0,
'구비시설<br/>
에어컨, TV, 냉장고, 와이파이,싱크대, 전기밥솥, 취사도구,욕실용품<br/>
객실설명<br/>
추가 요금 현장 결제 (1인 1만원)<br/>
 <br/>
테라스는 있으나 테라스에서 바베큐가 불가능합니다.<br/>', sysdate)

insert into room values(ROOM_SEQ.nextval, 2, '구름4호', '원룸(온돌룸+주방+화장실)', '10평', 4, 6, 210000, 210000, 80000, 120000, 0,
'구비시설<br/>
에어컨, TV, 냉장고, 와이파이,싱크대, 전기밥솥, 취사도구,욕실용품<br/>
객실설명<br/>
추가 요금 현장 결제 (1인 1만원)<br/>
 <br/>
테라스는 있으나 테라스에서 바베큐가 불가능합니다.<br/>', sysdate)

insert into room values(ROOM_SEQ.nextval, 2, '산들5호', '온돌룸2개+거실1개+주방+화장실2개', '25평', 8, 15, 330000, 330000, 180000, 220000, 0,
'구비시설<br/>
에어컨, TV, 냉장고, 와이파이,싱크대, 전기밥솥, 취사도구,욕실용품<br/>
객실설명<br/>
추가 요금 현장 결제 (1인 1만원)<br/>
 <br/>
테라스는 있으나 테라스에서 바베큐가 불가능합니다.<br/>', sysdate)

insert into room values(ROOM_SEQ.nextval, 2, '사랑채(복층)', '복층(침대룸+주방+화장실)', '10평', 2, 4, 200000, 200000, 70000, 110000, 0,
'구비시설<br/>
에어컨, TV, 냉장고, 와이파이,싱크대, 전기밥솥, 취사도구,욕실용품<br/>
객실설명<br/>
추가 요금 현장 결제 (1인 1만원)<br/>
 <br/>
테라스는 있으나 테라스에서 바베큐가 불가능합니다.<br/>', sysdate)

select * from room
select * from ROOM_PHOTO